# St7GetBeamID

Returns the ID number for the specified beam.

long St7GetBeamID(long uID, long BeamNum, long* BeamID)
Input Parameters
uID
Strand7 model file ID.
BeamNum
Beam number
Output Parameters
BeamID
Beam ID.